# -*- coding: utf-8 -*-
from idna import unicode

print("Привіт! Введи своє ім\'я")
name = str(input())
print("Вітаю в грі, " + name + "! Ти завжди вважав себе звичайнісінькою людиною, однак, зі всіми інколи трапляються пригоди")
print("Якось ти повертаєшся із своєї звичайнісінької роботи додому, а в тебе на дивані сидить чужинець, чоловік, середніх літ."
      "\nТвоя реакція: \n "
      "1.Точно злодій. Шукаю щось важке під рукою і атакую\n 2.Хто ви, що ви тут робите?\n Обери відповідь 1 чи 2" )

answer1 = str(input())
while answer1 == '1' or '2':
    if answer1 == '1':
        print("Чоловік направляє на тебе відкриту долонь. Невідома сила приковує тебе до стіни.\nПослухай мене - каже чоловік. "
              "Ти слухаєш, а що тобі ще лишається...")
        break
    elif answer1 == '2':
        print("Чоловік починає свою розповідь")
        break
    print("Обери відповідь")
    answer1 = str(input())

print("Мене звуть Отто, я ювелір. В моїх руках з\'являються незвичайні речі, магічні. Я зробив багато добра для цього світу.\n"
      "Допомогав закоханим знайти шлях один до одного за допомогою магічних кілець. Захищав дітей кулонами, що їм дарували матері.\n"
      "Посилював воїнів золотими браслетами. Але тепер допомога потрібна й мені самому.")
print("1.Так, звичайно, я готовий допомогти\n2.Не розумію, як це стосується мене. Я краще помру зараз, ніж прийматиму участь "
      "в таких квестах.")

answer2 = str(input())
while answer2 == '1' or '2':
    if answer2 =='1':
        print("Слухай далі. Колись я зробив магічний алмаз, що сцілить близьку мені людину. Але злий чаклун Копервольт викрав "
              "камінь і полонив ціле моє сімейство.\n З ним в бій вступив інший чаклун, але загинув в тому бою. Перед смертю "
              "він заповідав мені знайти людину, чисту серцем, і в жодному разі,\n не казати, для кого зроблений камінь. Ти маєш "
              "відчути це, і віддати алмаз прямо потребуючій людині, інакше сила втратиться, а вона ніколи не видужає.")
        break
    elif answer2 == '2':
        print("Я не робитиму тобі лиха. Сумно, що в цьому світі не лишилось героїв. Прощавай назавди. Колись ти шкодуватимеш."
              "\nКінець гри!")
        quit()
    print("Обери відповідь")
    answer2 = str(input())

print("Я відправлю тебе до замку чаклуна. Знайди камінь та поклади його у долоні потребуючій людині.\nЧоловік переносить тебе на зелену "
      "рівнину, посеред якої стоїть готичний замок. Ти бачиш\n1.Головний вхід\n2.Щілину між каменів стіни фортеці.\nКуди ти підеш?")

answer3 = str(input())
while answer3 == '1' or '2':
    if answer3 == '1':
        print(
        "Охорона помічає тебе. Чужинцям тут не місце. Тебе вбивають.\nКінець гри!")
        quit()
    elif answer3 == '2':
        print(
        "Ти потрапляєш в бібліотеку. До тебе звертається старий бібліотекар.")
        break
    print("Обери відповідь")
    answer3 = str(input())

print("Я знаю, хто ти і навіщо прийшов. Але не викажу тебе, якщо привильно відповіси на дві мої загадки.\n"
      "Загадка перша: Що сходить без насіння?")

answer4 = unicode(input(), "utf-8")
if answer4.lower() ==  unicode('сонце', "utf-8"):
    print("Вітаю! Ти правильно відповів на першу загадку.")
else:
    print("На жаль, ні. Бібліотекар кличе охорону. Тебе вбивають.\nКінець гри!")
    quit()

print("Час на другу загадку. Рогатий, а не бик, Пливе, а не качка?")

answer5 = unicode(input(), "utf-8")
if answer5.lower() ==  unicode('місяць', "utf-8"):
    print("З другою загадкою ти теж впорався. Обережно виходь у ці двері.")
else:
    print("На жаль, ні. Бібліотекар кличе охорону. Тебе вбивають.\nКінець гри!")
    quit()

print("Ти виходиш в коридор. Бачиш сходи вниз. В коридорі стоїть шафа. Що робитимеш?\n1.Спускаюсь вниз\n2.Відчиняю шафу")

answer6 = str(input())
while answer6 == '1' or '2':
    if answer6 == '1':
        print(
        "Охорона помічає тебе. Чужинцям тут не місце. Тебе вбивають.\nКінець гри!")
        quit()
    elif answer6 == '2':
        print(
        "В шафі лежить плащ і висить дзеркало. Ти вдягаєш плащ і виявляєш, що це плащ-невидимка!")
        break
    print("Обери відповідь")
    answer6 = str(input())

print("Ти спускаєшся вниз. Бачиш двох охоронців, клітку з людьми і скриньку. Твої дії?\n1.Намагаюсь вирубити охоронців "
      "врукопашну\n2.Йду до клітки\n3.Йду до скриньки")

answer7 = str(input())
while answer7 == '1' or '2' or '3':
    if answer7 == '1':
        print("Ти занадто слабкий, щоб здолати двох охоронців.\nКінець гри!")
        quit()
    elif answer7 == '2':
        print("Клітка закрита на замок. Ключ в охоронця. Ти можеш спробувати непомітно викрасти ключ, поки вони грають в карти."
              " Спробуєш?\n1.Так\n2.Ні")

        answer8 = str(input())
        while answer8 == '1' or '2':
            if answer8== '1':
                print("Вітаю! Ключ в тебе! Що ж робити далі?\n1.Попробую виманити охоронців з підвалу\n2.Йду до скриньки, "
                      "намагаюсь її відкрити")

                answer9 = str(input())
                while answer9 == '1' or '2':
                    if answer9 == '1':
                        print("Хороша ідея! Ти тихо виходиш з підвалу і кричиш: Ей, охорона, всі до головного входу! "
                              "Охоронці підхоплюються і вибігають з підвалу.")
                        print("Охорона вибігла. А ти йдеш до скриньки. На скриньці кодовий замок. Тобі доведеться ввести "
                              "правильний шифр. Ти бачиш підказку 65+32")

                        answer10 = str(input())
                        if answer10 == '6532':
                            print("Вітаю, ти відкрив скриньку з алмазом")
                            print("Тепер в тебе є ключ і камінь. Ти відкриваєш клітку і бачиш:\n1.Дівчину в темних окулярах\n"
                                  "2.Жінку з дитиною\n3.Сивого чоловіка\n4.Хлопця з рудим волоссям\nКому ти віддаєш камінь?")
                            answer11 = str(input())
                            while answer11 == '1' or '2' or '3' or '4':
                                if answer11 == '1':
                                    print(
                                    "Дівчина знімає окуляри. Вона сліпа. Це саме їй потрібен чарівний камінь. Ти вгадав!")
                                    quit()
                                if answer11 == '2':
                                    print(
                                    "Жінка дивитись на тебе і каже: дякую, що прийшов, але це не мені потрібен камінь."
                                    " Шкода.\nКінець гри!")
                                    quit()
                                if answer11 == '3':
                                    print(
                                    "Чоловік дивитись на тебе і каже: дякую, що прийшов, але це не мені потрібен камінь."
                                    " Шкода.\nКінець гри!")
                                    quit()
                                if answer11 == '4':
                                    print(
                                    "Хлопець дивитись на тебе і каже: дякую, що прийшов, але це не мені потрібен камінь. "
                                    " Шкода.\nКінець гри!")
                                    quit()
                                print("Обери відповідь")
                                answer11 = str(input())

                        else:
                            print("Неправильний код! Скринька вибухає.\nКінець гри!")
                            quit()

                    elif answer9 == '2':
                        print("По дорозі ти зашпортався і впав. Охорона тебе спіймала.\nКінець гри!")
                        quit()
                    print("Обери відповідь")
                    answer9 = str(input())

            elif answer8== '2':
                print("Поки ти стояв і думав, охоронці помітили твою тінь. Тебе спіймали\nКінець гри!")
                quit()
            print("Обери відповідь")
            answer8 = str(input())

    elif answer7 == '3':
        print("По дорозі ти зашпортався і впав. Охорона тебе спіймала.\nКінець гри!")
        quit()
    print("Обери відповідь")
    answer7 = str(input())




