
result1a = "Чоловік направляє на тебе відкриту долонь. Невідома сила приковує тебе до стіни.\nПослухай мене - каже чоловік. "
"Ти слухаєш, а що тобі ще лишається..."
result1b = "Чоловік починає свою розповідь"
question2 = "Мене звуть Отто, я ювелір. В моїх руках з\'являються незвичайні речі, магічні. Я зробив багато добра для цього світу.\n"
"Допомогав закоханим знайти шлях один до одного за допомогою магічних кілець. Захищав дітей кулонами, що їм дарували матері.\n"
"Посилював воїнів золотими браслетами. Але тепер допомога потрібна й мені самому." "1.Так, звичайно, я готовий допомогти\n" \
"2.Не розумію, як це стосується мене. Я краще помру зараз, ніж прийматиму участь "
"в таких квестах."
result2a = "Слухай далі. Колись я зробив магічний алмаз, що сцілить близьку мені людину. Але злий чаклун Копервольт викрав "
"камінь і полонив ціле моє сімейство.\n З ним в бій вступив інший чаклун, але загинув в тому бою. Перед смертю "
"він заповідав мені знайти людину, чисту серцем, і в жодному разі,\n не казати, для кого зроблений камінь. Ти маєш "
"відчути це, і віддати алмаз прямо потребуючій людині, інакше сила втратиться, а вона ніколи не видужає."
result2b = "Я не робитиму тобі лиха. Сумно, що в цьому світі не лишилось героїв. Прощавай назавди. Колись ти шкодуватимеш."
"\nКінець гри!"
question3 = "Я відправлю тебе до замку чаклуна. Знайди камінь та поклади його у долоні потребуючій людині.\nЧоловік переносить тебе на зелену "
"рівнину, посеред якої стоїть готичний замок. Ти бачиш\n1.Головний вхід\n2.Щілину між каменів стіни фортеці.\nКуди ти підеш?"
answer3a = "Охорона помічає тебе. Чужинцям тут не місце. Тебе вбивають.\nКінець гри!"
answer3b = "Ти потрапляєш в бібліотеку. До тебе звертається старий бібліотекар."
question4 = "Я знаю, хто ти і навіщо прийшов. Але не викажу тебе, якщо привильно відповіси на дві мої загадки.\n"
"Загадка перша: Що сходить без насіння?"
result4a = "Вітаю! Ти правильно відповів на першу загадку."
result4b = "На жаль, ні. Бібліотекар кличе охорону. Тебе вбивають.\nКінець гри!"
question5 ="Час на другу загадку. Рогатий, а не бик, Пливе, а не качка?"
result5a = "З другою загадкою ти теж впорався. Обережно виходь у ці двері."
question6 = "Ти виходиш в коридор. Бачиш сходи вниз. В коридорі стоїть шафа. Що робитимеш?\n1.Спускаюсь вниз\n2.Відчиняю шафу"
result6a = "Охорона помічає тебе. Чужинцям тут не місце. Тебе вбивають.\nКінець гри!"
result6b = "В шафі лежить плащ і висить дзеркало. Ти вдягаєш плащ і виявляєш, що це плащ-невидимка!"
question7 = "Ти спускаєшся вниз. Бачиш двох охоронців, клітку з людьми і скриньку. Твої дії?\n1.Намагаюсь вирубити охоронців "
"врукопашну\n2.Йду до клітки\n3.Йду до скриньки"
result7a = "Ти занадто слабкий, щоб здолати двох охоронців.\nКінець гри!"
question8 = "Клітка закрита на замок. Ключ в охоронця. Ти можеш спробувати непомітно викрасти ключ, поки вони грають в карти."
" Спробуєш?\n1.Так\n2.Ні"
result8b = "Поки ти стояв і думав, охоронці помітили твою тінь. Тебе спіймали\nКінець гри!"
question9 = "Вітаю! Ключ в тебе! Що ж робити далі?\n1.Попробую виманити охоронців з підвалу\n2.Йду до скриньки, "
"намагаюсь її відкрити"
result9b = "По дорозі ти зашпортався і впав. Охорона тебе спіймала.\nКінець гри!"
question10 = "Хороша ідея! Ти тихо виходиш з підвалу і кричиш: Ей, охорона, всі до головного входу! "
"Охоронці підхоплюються і вибігають з підвалу." "Охорона вибігла. А ти йдеш до скриньки. На скриньці кодовий замок. Тобі доведеться ввести "
"правильний шифр. Ти бачиш підказку 65+32"
result10b = "Неправильний код! Скринька вибухає.\nКінець гри!"
question11 = "Вітаю, ти відкрив скриньку з алмазом""Тепер в тебе є ключ і камінь. Ти відкриваєш клітку і бачиш:\n1.Дівчину в темних окулярах\n"
"2.Жінку з дитиною\n3.Сивого чоловіка\n4.Хлопця з рудим волоссям\nКому ти віддаєш камінь?"
result11a = "Дівчина знімає окуляри. Вона сліпа. Це саме їй потрібен чарівний камінь. Ти вгадав!"
result11b = "Жінка дивитись на тебе і каже: дякую, що прийшов, але це не мені потрібен камінь."
" Шкода.\nКінець гри!"
result11c = "Чоловік дивитись на тебе і каже: дякую, що прийшов, але це не мені потрібен камінь."
" Шкода.\nКінець гри!"
result11d = "Хлопець дивитись на тебе і каже: дякую, що прийшов, але це не мені потрібен камінь. "
" Шкода.\nКінець гри!"


class MyGame:

    def run(self):
        self.displayintro()
        self.first_question()
        self.second_question()

    def first_question(self):
        print("\nТвоя реакція: \n "
              "1.Точно злодій. Шукаю щось важке під рукою і атакую\n 2.Хто ви, що ви тут робите?\n Обери відповідь 1 чи 2" )
        continue_loop = True
        while continue_loop:
            answer1 = str(input())
            if answer1 == "1":
                print(result1a)
                continue_loop = False
            elif answer1 == "2":
                print(result1b)
                continue_loop = False
            else:
                print("Обери відповідь 1 чи 2")

    def second_question(self):
        print(question2)
        continue_loop = True
        while continue_loop:
            answer1 = str(input())
            if answer1 == "1":
                print(result2a)
                continue_loop = False
            elif answer1 == "2":
                print(result2b)
                continue_loop = False
            else:
                print("Обери відповідь 1 чи 2")

    def displayintro(self):
        print("Привіт! Введи своє ім\'я")
        name = str(input())
        print("Вітаю в грі, {}.".format(name))
        print("Ти завжди вважав себе звичайнісінькою людиною, однак, зі всіми інколи трапляються пригоди")
        print("Якось ти повертаєшся із своєї звичайнісінької роботи додому, а в тебе на дивані сидить чужинець, чоловік, середніх літ.")


def main():
    mygame = MyGame()
    mygame.run()


if __name__ == "__main__":
    main()
